In [5]:
import numpy as np
import pandas as pd

*********************
**Merging 2 Dataframes**
*********************

In [10]:
employees = pd.DataFrame({
    'employee_id': [1, 2, 3, 4, 5],
    'name': ['John', 'Anna', 'Peter', 'Linda', 'Bob'],
    'department': ['HR', 'IT', 'Finance', 'IT', 'HR']
})

# DataFrame 2: Salary information
salaries = pd.DataFrame({
    'employee_id': [1, 2, 3, 6, 7],
    'salary': [60800, 80880, 65888, 78000, 90000],
    'bonus': [5800, 10000, 7080, 8000, 12000]
})

In [11]:
employees

   employee_id   name department
0            1   John         HR
1            2   Anna         IT
2            3  Peter    Finance
3            4  Linda         IT
4            5    Bob         HR

In [12]:
salaries

   employee_id  salary  bonus
0            1   60800   5800
1            2   80880  10000
2            3   65888   7080
3            6   78000   8000
4            7   90000  12000

In [17]:
pd.merge(employees, salaries, on="employee_id", how="left")

   employee_id   name department   salary    bonus
0            1   John         HR  60800.0   5800.0
1            2   Anna         IT  80880.0  10000.0
2            3  Peter    Finance  65888.0   7080.0
3            4  Linda         IT      NaN      NaN
4            5    Bob         HR      NaN      NaN

*******************
**Concatination of 2 Dataframes**
*******************

In [24]:
df1 = pd.DataFrame({
    'A': ['A0', 'A1', 'A2'],
    'B': ['B0', 'B1', 'B2'],
    'C': ['C0', 'C1', 'C2']
})

df2 = pd.DataFrame({
    'A': ['A3', 'A4', 'A5'],
    'B': ['B3', 'B4', 'B5'],
    'C': ['C3', 'C4', 'C5']
})

In [25]:
dfcat = pd.concat([df1, df2], axis=1)

In [26]:
dfcat

    A   B   C   A   B   C
0  A0  B0  C0  A3  B3  C3
1  A1  B1  C1  A4  B4  C4
2  A2  B2  C2  A5  B5  C5

************************
**Joining 2 DataFrames**
*************************

In [30]:
df1 = pd.DataFrame({
    'name': ['Alice', 'Bob', 'Charlie']
}, index=[1, 2, 3])

# Second Dataframe
df2 = pd.DataFrame({
    'score': [85, 90, 75]
}, index=[2, 3, 4])

In [31]:
df1.join(df2, how="outer")

      name  score
1    Alice    NaN
2      Bob   85.0
3  Charlie   90.0
4      NaN   75.0